app/controllers/companies_controller.rb

SELECT * FROM "companies"
---
  def index
    @companies = Company.all

INSERT INTO "companies" ("created_at", "name", "address", "updated_at") VALUES('2013-10-27 14:53:38', 'ddddd', NULL, '2013-10-27 14:53:38')
---
  def create
   # @company = Company.new(params[:company])
   params[:companies].each do |company|
     company = Company.create(company)